[
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/WGSqcjS/Icelandic-Cocoa-Soup.jpg",
    "price": 33,
    "ratings": 5,
    "reviews": 49,
    "name": "Icelandic Cocoa Soup",
    "description": "This Icelandic dessert is so delicious, that it is very often served as a main course. A particular favourite amongst kids, it's easy to make and always greatly appreciated.",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": [
      "3 tablespoons cocoa powder",
      "3 tablespoons sugar",
      "1/2 teaspoon cinnamon",
      "2 cups water",
      "3 cups milk",
      "1 tablespoon potato starch or 1 tablespoon cornstarch",
      "salt, to taste"
    ],
    "preparation": [
      "Mix the cocoa powder, sugar and cinnamon in a saucepan.",
      "Add the water gradually and stir until smooth.",
      " Bring to boil and simmer for 5 minutes.",
      "Add the milk, reheat to boiling point and simmer for 2-3 minutes.",
      "3 cups milk",
      "1 tablespoon potato starch or 1 tablespoon cornstarch",
      "Mix the potato starch or cornstarch with a little cold water, stir into soup and remove from heat",
      "Salt to taste and serve."
    ]
  },
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/rvg7sW3/Chana-garbanzo-bean-salad.jpg",
    "price": 23,
    "ratings": 4.3,
    "reviews": 33,
    "name": "Chana (garbanzo bean) salad",
    "description": "Hot or cold, served with pita bread",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": [
      "2 28-oz cans garbanzo beans",
      "2 cups boiled and diced potatoes",
      "1/4 cup vegetable oil",
      "1 tsp cumin seeds*",
      "1 medium onion, finely sliced",
      "1 tsp salt( or to taste)",
      "1/2 tsp cayenne pepper or chili powder",
      "1 tsp ground corriander powder*",
      "t/2 tsp turmeric*",
      "1/2 tsp ground ginger",
      "1/2 tsp garlic powder",
      "1 tsp garam masala powder",
      "1/4 cup lemon juice, or to taste",
      "*items can be purchased at Indian grocery store."
    ],
    "preparation": "Drain the cans of beans and save juice. Heat the oil in a saucepan and add the cumin seeds. When the seeds start to crack, add the sliced onion and fry until golden Add all the other ingredients and mix well. If the mixture is too thick, add some of the liquid saved from the cans. Bring to a boil. Reduce heat and simmer for 15 minutes."
  },
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/stnbcFw/Cheese-Parcels.jpg",
    "price": 44,
    "ratings": 4.9,
    "reviews": 12,
    "name": "Cheese Parcels",
    "description": "This Cheese Parcels is so delicious, that it is very often served as a main course. A particular favourite amongst kids, it's easy to make and always greatly appreciated.",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": [
      "1 cup (250 milliliters) orange juice",
      "Scant 1/2 cup (100 milliliters) clear honey",
      "3 balls fresh mozzarella (each around 6 centimeters / 2 1/2 inches in diameter), quartered",
      "12 sheets filo pastry, 23 x 36 1/2 centimeters / 9 x 14 inches (or cut larger sheets to size)",
      "2 cups (500 milliliters) sunflower oil",
      "1 1/4 cups (150 grams / 5 1/2 ounces) chopped walnuts",
      "1 1/2 cups (150 grams / 5 1/2 ounces) slivered almonds",
      "2 tablespoons confectioner's sugar (optional)"
    ],
    "preparation": [
      "First, make the reduction: in a small pot, combine the orange juice and honey and simmer over low heat, stirring occasionally, for about 30 minutes, until syrupy.",
      "Prepare the cheese parcels by loosely wrapping each section of cheese in filo pastry, pressing the seams together. While working on assembling them, keep the pastry sheets and finished parcels moist under a damp tea towel to avoid drying out.",
      "In a small saucepan, heat the sunflower oil over medium heat. When it is smoking, quickly plunge the parcels into the oil for 20 seconds or until the pastry turns golden. Using a slotted spoon, transfer to a plate lined with paper towels to absorb any excess oil.",
      "Immediately transfer to a serving plate, drizzle with the reduction, sprinkle with nuts and dust with confectioner’s sugar if desired. Serve promptly."
    ]
  },
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/dQP8NCM/Baked-Chicken-Pasta.jpg",
    "price": 26,
    "ratings": 5,
    "reviews": 22,
    "name": "Baked Chicken Pasta",
    "description": "Although pasta is not a traditional Lebanese ingredient, but this dish was a favorite in our house, not just in Ramadan, but any time of the year. It is filling, delicious, quick to make especially if you buy a cooked rotisserie chicken!",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": [
      "4 tbs of butter",
      " 4 tbs of flour",
      "2 cups of Milk",
      "1/2 tsp of Salt",
      "1 tsp of Pepper",
      "1/2 tsp of Nutmeg",
      "1/2 lb of mixed frozen vegetables",
      "1 lb chicken breast",
      "3/4 box of Elbow pasta",
      "1.5 cups of grated Mozarella cheese",
      "1 cup of grated sharp cheddar or Gruyere or Swiss cheese"
    ],
    "preparation": [
      "Boil the chicken breast in water for about 20 min until it registers 165F in the thickest part.",
      "once the chicken is cooked, remove from the heat and let cool. Reserve the broth",
      "Mince the chicken into small pieces",
      "to Prepare the sauce, melt the butter in a sauce pan.",
      " Add the flour, mix it with butter and cook for 1-2 min, at medium heat",
      " add the milk slowly while whisking",
      " reduce the heat and whisk occasionally",
      "once the sauce thickens (about 10 min), add spices",
      "Add 1/2 cup of the chicken broth",
      "taste and adjust accordingly (I like to have a prominent nutmeg flavor)",
      "add the frozen vegetables and minced chicken",
      "Boil the pasta according to the instructions.",
      "In a oven pan:",
      "Pasta and sauce and cover with the cheese.",
      "bake uncovered at 350F for 30-40 min until the cheese melts and becomes golden brown.",
      "Let it rest for 10 min and serve"
    ]
  },
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/LSSL1Pc/Cinnamon-Buns.jpg",
    "price": 33,
    "ratings": 5,
    "reviews": 49,
    "name": "Cinnamon Buns",
    "description": "Kanelbullar or cinnamon buns are a classic at Swedish coffee parties. During the golden age of home baking, such parties turned into orgies of sweet yeast breads, small cookies, cookies with fillings, pastries and cakes. This tradition lives on in Sweden. If you are invited to someone’s home for coffee, you always get a cinnamon bun, a cookie or a piece of cake with it. And at cafés, dainty little cookies continue to compete with all those supersized American muffins.",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": [
      "(25 buns)",
      "35 g (1¼ oz) yeast",
      "100 g (3½ oz) sugar",
      "300 ml (1½ cup) milk",
      "1 egg",
      "120 g (4 oz) butter",
      "1 tsp salt",
      "1 tbs ground cardemom",
      "750 g (26 oz) flour",
      "Filling:",
      "100 g (4 oz) butter",
      "50 g (2 oz) sugar",
      "2 tbs cinammon",
      "Glaze:",
      "1 egg",
      "2 tbs water",
      "pearl sugar"
    ],
    "preparation": [
      "Crumble the yeast in a bowl and stir in a few tablespoons of milk. Melt the butter and pour the milk on it. Add the rest of the ingredients and knead the dough in a dough mixer for 10–15 minutes. Let the dough rise while covered at room temperature for 30 minutes.",
      "Roll out the dough so it is about 3 mm (1/8 in) thick and 30 cm (12 in) wide. Spread the room-temperature butter on top. Make a mixture of sugar and cinnamon and sprinkle it over the dough. Roll the dough the long way and cut the roll into about 25 slices. Place them with the cut edge upward in paper molds. Place on a baking sheet and let rise under a towel for about 60 minutes or until the buns have doubled in size.",
      "Beat together the egg and water, brush the mixture carefully on the buns and sprinkle pearl sugar on top. Bake in the oven (220°C/425°F) for 5–6 minutes. Allow to cool on a rack."
    ]
  },
  {
    "categoryId": "63fa596f3bda339310e845ff",
    "picture": "https://i.ibb.co/N6TS31S/Fig-Leaves-Tea.jpg",
    "price": 43,
    "ratings": 4.8,
    "reviews": 29,
    "name": "Fig Leaves Tea",
    "description": "Fig leaves although edible are usually bland, stringy and tough and not pleasing to taste. However, a dried coarse powdered or chopped form is better and is easy to incorporate in recipes or make tea.",
    "registered": "2020-08-21T06:45:10 -06:00",
    "ingredients": ["Fig tree leaves"],
    "preparation": [
      "If you live in a place where there are fig trees you can prepare the tea leaves yourself.",
      "According to various health practitioners, fig leaf and fruit contain chemicals that MAY help move food through the intestines better or help to control blood sugar and cholesterol levels.",
      "There are plenty of online resources you can research yourself. Regardless of these benefits, fig leaf tea makes a nice fragrant caffeine free tea.",
      "Use scissors to cut 15-20 mature fig tree leaves. You can cut them at the based of the leaf stem where you will see white sap ease out.",
      "Gather all the leaves in a large basin and wash them gently with warm water.",
      "Dry the leaves by shaking off the water. You can pat down the leaves with a towel. You can also put them in the washer on spin for just a few minutes to get all the water out.",
      "Lay down a clean sheet in a well lit room and spread the leaves to completely dry until they are crisp. This may take a few days based on the humidity in the environment.",
      "Once the leaves are dry, place a few leaves at a time in a food processor. Pulse the leaves to a coarse chop. You do not need to make a powder out of them.",
      "Once your leaves are chopped, store them in glass containers. Keep them in the cabinet away from the sun so the sun does not turn the leaves brown.",
      "Place 2 tablespoons in a liter of water and bring to boil.",
      "Boil the leaves for 15-30 minutes or until half the pot of water has evaporated.",
      "Remove the tea from the stove and strain the leaves.",
      "Enjoy the tea.",
      "You can store the left over tea in the refrigerator until needed.",
      "To see any health benefits it is recommended to drink this tea every day.",
      "As they say in Arabic Sahtain .. wish you double health!"
    ]
  }
]
